# 빅데이터 분석기사 실기 준비 놀이터
- https://www.kaggle.com/datasets/agileteam/bigdatacertificationkr

## T1-7. Replace / #값변경 #조건 #최대값

### 7. 값 변경
- 데이터셋 : basic1.csv
- 'f4'컬럼의 값이 'ESFJ'인 데이터를 'ISFJ'로 대체하고, 'city'가 '경기'이면서 'f4'가 'ISFJ'인 데이터 중 'age'컬럼의 최대값을 출력
- https://www.kaggle.com/code/agileteam/py-t1-7-2-expected-questions
/notebook

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./data/basic1.csv')

display(df.head())
df.shape

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

(100, 8)

In [3]:
esfj_index = df[df['f4'] == 'ESFJ'].index
df.loc[esfj_index]['f4']

8     ESFJ
12    ESFJ
30    ESFJ
58    ESFJ
98    ESFJ
Name: f4, dtype: object

In [4]:
esfj_index = df[df['f4'] == 'ESFJ'].index
df['f4'] = df['f4'].replace('ESFJ', 'ISFJ')

df.loc[esfj_index]['f4']

8     ISFJ
12    ISFJ
30    ISFJ
58    ISFJ
98    ISFJ
Name: f4, dtype: object

In [5]:
df[(df['city'] == '경기') & (df['f4'] == 'ISFJ')]['age'].max()

90.0

## T1-8. Cumulative Sum / #누적합 #결측치 #보간

### 8. 누적합과 보간
- 데이터셋 : basic1.csv
- 'f2' 컬럼이 1인 조건에 해당하는 데이터의 'f1'컬럼 누적합을 계산한다
- 이때 발생하는 누적합 결측치는 바로 뒤의 값을 채우고, 누적합의 평균값을 출력한다.
- 단, 결측치 바로 뒤의 값이 없으면 다음에 나오는 값을 채워넣는다
- https://www.kaggle.com/code/agileteam/py-t1-8-expected-questions/notebook

In [6]:
import numpy as np
import pandas as pd

In [7]:
df = pd.read_csv('./data/basic1.csv')

display(df.head())
df.shape

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

(100, 8)

In [8]:
cumsum = df[df['f2'] == 1]['f1'].cumsum() # 누적합
cumsum.fillna(method= 'bfill', inplace=True) # 결측치는 뒤의값 활용

cumsum.mean()

980.3783783783783

## T1-9. Standardization / #표준화 #중앙값

### 9. 수치형 변수 변환
- 데이터셋 : basic1.csv
- 'f5'컬럼을 표준화하고 그 중앙값을 구하라
- https://www.kaggle.com/code/agileteam/py-t1-9-expected-questions/notebook

In [9]:
import numpy as np
import pandas as pd

In [10]:
df = pd.read_csv('./data/basic1.csv')

display(df.head())
df.shape

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

(100, 8)

In [11]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

df['f5'] = scaler.fit_transform(df[['f5']])
df.head()

     id   age city    f1  f2   f3    f4        f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  1.220815
1  id02   9.0   서울  70.0   1  NaN  ENFJ  0.127343
2  id03  27.0   서울  61.0   1  NaN  ISTJ -1.394535
3  id04  75.0   서울   NaN   2  NaN  INFP -0.143667
4  id05  24.0   서울  85.0   2  NaN  ISFJ -0.970085

In [12]:
df['f5'].median()

0.26061962955901524

## T1-10. Yeo-Johnson and Box–Cox / #여존슨 #박스-콕스 #결측치 #최빈값

### 10. 수치형 변수 변환2
- 데이터셋 : basic1.csv
- 20세 이상인 데이터를 추출하고 'f1'컬럼을 결측치를 최빈값으로 채운 후
- f1 컬럼의 여-존슨과 박스콕스 변환 값을 구하고, 두 값의 차이를 절대값으로 구한다음 모두 더해 소수점 둘째 자리까지 출력(반올림)
- https://www.kaggle.com/code/agileteam/py-t1-10-expected-questions/notebook

In [13]:
import numpy as np
import pandas as pd

In [14]:
df = pd.read_csv('./data/basic1.csv')

display(df.head())
df.shape

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

(100, 8)

In [15]:
df = df[df['age'] >= 20]
df.shape

(83, 8)

In [16]:
print('f1 컬럼 결측치 개수 :', len(df[df['f1'].isnull()]))

df['f1'] = df['f1'].fillna(df['f1'].mode()[0])

print('결측치 최빈값 대체후 f1 컬럼 결측치 개수 :', len(df[df['f1'].isnull()]))

f1 컬럼 결측치 개수 : 26
결측치 최빈값 대체후 f1 컬럼 결측치 개수 : 0

In [17]:
from sklearn.preprocessing import power_transform

df['johnson'] = power_transform(df[['f1']],standardize=False)
df['boxcox'] = power_transform(df[['f1']], method='box-cox', standardize=False)

print(round(sum(abs(df['johnson'] - df['boxcox'])), 2))

39.17

## T1-11. min-max scaling / #스케일링 #상하위값

### 11. 수치형 변수 변환3
- 데이터셋 : basic1.csv
- 'f5'컬럼을 min-max 스케일 변환한 후, 상위 5%와 하위 5% 값의 합을 구하시오
- https://www.kaggle.com/code/agileteam/py-t1-11-min-max-5-expected-questions/notebook

In [18]:
import numpy as np
import pandas as pd

In [19]:
df = pd.read_csv('./data/basic1.csv')

display(df.head())
df.shape

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

(100, 8)

In [20]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
df['f5'] = scaler.fit_transform(df[['f5']])

high = df['f5'].quantile(0.95)
low = df['f5'].quantile(0.05)

print('상위 5% :', high, '\n하위 5% :', low, '\n합계 :',high+low)

상위 5% : 0.9881662742993513
하위 5% : 0.03670782406038746
합계 : 1.0248740983597389

## T1-12. top10-bottom10 / #그룹핑 #정렬 #상하위값

### 12. 그룹핑
- 데이터셋 : covid_vaccination_vs_death_ratio.csv
- 상위 10개 국가의 접종률 평균과 하위 10개 국가의 접종률 평균을 구하고, 그 차이를 구하라
- 단, 100%가 넘는 접종률 제거, 소수 첫째자리까지 출력
- https://www.kaggle.com/code/agileteam/py-t1-12-10-10-expected-questions/notebook

In [21]:
import numpy as np
import pandas as pd

In [22]:
df = pd.read_csv('./data/covid_vaccination_vs_death_ratio.csv', index_col=0)

display(df.head())
df.shape

,country,iso_code,date,total_vaccinations,people_vaccinated,people_fully_vaccinated,New_deaths,population,ratio
0,Afghanistan,AFG,2021-05-11,504502.0,448878.0,55624.0,12,40094444.0,1.119552
1,Afghanistan,AFG,2021-05-20,547901.0,470341.0,77560.0,10,40094444.0,1.173083
2,Afghanistan,AFG,2021-05-24,573277.0,476367.0,96910.0,10,40094444.0,1.188112
3,Afghanistan,AFG,2021-05-26,590454.0,479372.0,111082.0,19,40094444.0,1.195607
4,Afghanistan,AFG,2021-05-27,593313.0,479574.0,113739.0,14,40094444.0,1.196111

(20332, 9)

In [23]:
df = df[['country', 'ratio']].groupby('country').max().sort_values(by='ratio', ascending=False)
df = df[df['ratio'] < 100]

df.head()

                          ratio
country
Malta                 94.878361
United Arab Emirates  94.163348
Portugal              88.172139
Cuba                  84.786477
Cayman Islands        83.507527

In [24]:
top10 = df['ratio'].head(10).mean()
bottom10 = df['ratio'].tail(10).mean()
diff = round(top10 - bottom10, 1)

print('상위 10개 국가 접종률 평균 :', top10, '\n하위 10개 국가 접종률 평균 :', bottom10, '\n접종률 차이 :', diff)

상위 10개 국가 접종률 평균 : 85.07917839913583
하위 10개 국가 접종률 평균 : 0.8901804081545984
접종률 차이 : 84.2

# Summary

> 7. 값 변경
    - df['col'].replace('기존값', '변경값')

> 8. 누적합과 보간
    - 누적합 : df.cumsum()
    - 앞데이터 활용 결측치 대체 : df.fillna(method='ffill')
    - 뒤데이터 활용 결측치 대체 : df.fillna(method='bfill')

> 9. 표준화
    - from sklearn.preprocessing import StandardScaler
    - scaler = StandarScaler()
    - df['col'] = scaler.fit_transform(df[['col']])

> 10. 여존슨과 박스콕스 변환
    - from sklearn.preprocessing import power_transform
    - 여존슨 : df['col'] = power_transform(df[['col']], standardize=False)
    - 박스콕스 : df['col'] = power_transfrom(df[['col']], method='box-cox', standardize=False)

> 11. Min-Max 스케일링
    - from sklearn.preprocessing import MInMaxScaler
    - scaler = MinMaxScaler()
    - df['col'] = df['col'].fit_transform(df[['col']])

> 12. 그룹핑
    - df.groupby([col]).집계함수()